Revit 2027 API
AlignmentStationLabel Properties
The AlignmentStationLabel type exposes the following members.
Properties
Name | Description
AlignmentId |  The ElementId of the Alignment on which the SpotDimension is placed.
Element |  The underlying SpotDimension element.
Station |  The alignment station at which the SpotDimension is placed.
Top
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace